; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_4)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 link11 link12 link13 link14 - link
    angle0 angle30 angle60 angle90 angle120 angle150 angle180 angle210 angle240 angle270 angle300 angle330 - angle)
(:init
    (AngleOrd angle0 angle30)
    (AngleOrd angle30 angle60)
    (AngleOrd angle60 angle90)
    (AngleOrd angle90 angle120)
    (AngleOrd angle120 angle150)
    (AngleOrd angle150 angle180)
    (AngleOrd angle180 angle210)
    (AngleOrd angle210 angle240)
    (AngleOrd angle240 angle270)
    (AngleOrd angle270 angle300)
    (AngleOrd angle300 angle330)
    (AngleOrd angle330 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)
    (IsChildOf link11 link10)
    (IsChildOf link12 link11)
    (IsChildOf link13 link12)
    (IsChildOf link14 link13)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)
    (Affected link10 link1)
    (Affected link10 link2)
    (Affected link10 link3)
    (Affected link10 link4)
    (Affected link10 link5)
    (Affected link10 link6)
    (Affected link10 link7)
    (Affected link10 link8)
    (Affected link10 link9)
    (Affected link11 link1)
    (Affected link11 link2)
    (Affected link11 link3)
    (Affected link11 link4)
    (Affected link11 link5)
    (Affected link11 link6)
    (Affected link11 link7)
    (Affected link11 link8)
    (Affected link11 link9)
    (Affected link11 link10)
    (Affected link12 link1)
    (Affected link12 link2)
    (Affected link12 link3)
    (Affected link12 link4)
    (Affected link12 link5)
    (Affected link12 link6)
    (Affected link12 link7)
    (Affected link12 link8)
    (Affected link12 link9)
    (Affected link12 link10)
    (Affected link12 link11)
    (Affected link13 link1)
    (Affected link13 link2)
    (Affected link13 link3)
    (Affected link13 link4)
    (Affected link13 link5)
    (Affected link13 link6)
    (Affected link13 link7)
    (Affected link13 link8)
    (Affected link13 link9)
    (Affected link13 link10)
    (Affected link13 link11)
    (Affected link13 link12)
    (Affected link14 link1)
    (Affected link14 link2)
    (Affected link14 link3)
    (Affected link14 link4)
    (Affected link14 link5)
    (Affected link14 link6)
    (Affected link14 link7)
    (Affected link14 link8)
    (Affected link14 link9)
    (Affected link14 link10)
    (Affected link14 link11)
    (Affected link14 link12)
    (Affected link14 link13)

    (HasAngle angle120 link1)
    (HasAngle angle270 link2)
    (HasAngle angle180 link3)
    (HasAngle angle210 link4)
    (HasAngle angle60 link5)
    (HasAngle angle30 link6)
    (HasAngle angle330 link7)
    (HasAngle angle60 link8)
    (HasAngle angle150 link9)
    (HasAngle angle150 link10)
    (HasAngle angle60 link11)
    (HasAngle angle0 link12)
    (HasAngle angle270 link13)
    (HasAngle angle150 link14)
)
(:goal
(and
    (HasAngle angle210 link1)
    (HasAngle angle300 link2)
    (HasAngle angle150 link3)
    (HasAngle angle240 link4)
    (HasAngle angle180 link5)
    (HasAngle angle90 link6)
    (HasAngle angle120 link7)
    (HasAngle angle210 link8)
    (HasAngle angle90 link9)
    (HasAngle angle120 link10)
    (HasAngle angle90 link11)
    (HasAngle angle0 link12)
    (HasAngle angle30 link13)
    (HasAngle angle240 link14)
    )
)
)

; plan
1. (increase_angle link1 angle120 angle150)
   deleted: (hasangle angle120 link1) (hasangle angle270 link2) (hasangle angle180 link3) (hasangle angle210 link4) (hasangle angle60 link5) (hasangle angle30 link6) (hasangle angle330 link7) (hasangle angle60 link8) (hasangle angle150 link9) (hasangle angle150 link10) (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   added: (hasangle angle150 link1) (hasangle angle300 link2) (hasangle angle210 link3) (hasangle angle240 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle0 link7) (hasangle angle90 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   goals met: 3 of 14
2. (increase_angle link1 angle150 angle180)
   deleted: (hasangle angle150 link1) (hasangle angle300 link2) (hasangle angle210 link3) (hasangle angle240 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle0 link7) (hasangle angle90 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   added: (hasangle angle180 link1) (hasangle angle330 link2) (hasangle angle240 link3) (hasangle angle270 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle30 link7) (hasangle angle120 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 1 of 14
3. (increase_angle link1 angle180 angle210)
   deleted: (hasangle angle180 link1) (hasangle angle330 link2) (hasangle angle240 link3) (hasangle angle270 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle30 link7) (hasangle angle120 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle210 link1) (hasangle angle0 link2) (hasangle angle270 link3) (hasangle angle300 link4) (hasangle angle150 link5) (hasangle angle120 link6) (hasangle angle60 link7) (hasangle angle150 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 2 of 14
4. (decrease_angle link2 angle0 angle330)
   deleted: (hasangle angle0 link2) (hasangle angle270 link3) (hasangle angle300 link4) (hasangle angle150 link5) (hasangle angle120 link6) (hasangle angle60 link7) (hasangle angle150 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   added: (hasangle angle330 link2) (hasangle angle240 link3) (hasangle angle270 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle30 link7) (hasangle angle120 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 2 of 14
5. (decrease_angle link2 angle330 angle300)
   deleted: (hasangle angle330 link2) (hasangle angle240 link3) (hasangle angle270 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle30 link7) (hasangle angle120 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle300 link2) (hasangle angle210 link3) (hasangle angle240 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle0 link7) (hasangle angle90 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   goals met: 4 of 14
6. (decrease_angle link3 angle210 angle180)
   deleted: (hasangle angle210 link3) (hasangle angle240 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle0 link7) (hasangle angle90 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   added: (hasangle angle180 link3) (hasangle angle210 link4) (hasangle angle60 link5) (hasangle angle30 link6) (hasangle angle330 link7) (hasangle angle60 link8) (hasangle angle150 link9) (hasangle angle150 link10) (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   goals met: 3 of 14
7. (decrease_angle link3 angle180 angle150)
   deleted: (hasangle angle180 link3) (hasangle angle210 link4) (hasangle angle60 link5) (hasangle angle30 link6) (hasangle angle330 link7) (hasangle angle60 link8) (hasangle angle150 link9) (hasangle angle150 link10) (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   added: (hasangle angle150 link3) (hasangle angle180 link4) (hasangle angle30 link5) (hasangle angle0 link6) (hasangle angle300 link7) (hasangle angle30 link8) (hasangle angle120 link9) (hasangle angle120 link10) (hasangle angle30 link11) (hasangle angle330 link12) (hasangle angle240 link13) (hasangle angle120 link14)
   goals met: 4 of 14
8. (increase_angle link4 angle180 angle210)
   deleted: (hasangle angle180 link4) (hasangle angle30 link5) (hasangle angle0 link6) (hasangle angle300 link7) (hasangle angle30 link8) (hasangle angle120 link9) (hasangle angle120 link10) (hasangle angle30 link11) (hasangle angle330 link12) (hasangle angle240 link13) (hasangle angle120 link14)
   added: (hasangle angle210 link4) (hasangle angle60 link5) (hasangle angle30 link6) (hasangle angle330 link7) (hasangle angle60 link8) (hasangle angle150 link9) (hasangle angle150 link10) (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   goals met: 4 of 14
9. (increase_angle link4 angle210 angle240)
   deleted: (hasangle angle210 link4) (hasangle angle60 link5) (hasangle angle30 link6) (hasangle angle330 link7) (hasangle angle60 link8) (hasangle angle150 link9) (hasangle angle150 link10) (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   added: (hasangle angle240 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle0 link7) (hasangle angle90 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   goals met: 5 of 14
10. (increase_angle link5 angle90 angle120)
   deleted: (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle0 link7) (hasangle angle90 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   added: (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle30 link7) (hasangle angle120 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 5 of 14
11. (increase_angle link5 angle120 angle150)
   deleted: (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle30 link7) (hasangle angle120 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle150 link5) (hasangle angle120 link6) (hasangle angle60 link7) (hasangle angle150 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 5 of 14
12. (increase_angle link5 angle150 angle180)
   deleted: (hasangle angle150 link5) (hasangle angle120 link6) (hasangle angle60 link7) (hasangle angle150 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   added: (hasangle angle180 link5) (hasangle angle150 link6) (hasangle angle90 link7) (hasangle angle180 link8) (hasangle angle270 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   goals met: 6 of 14
13. (decrease_angle link6 angle150 angle120)
   deleted: (hasangle angle150 link6) (hasangle angle90 link7) (hasangle angle180 link8) (hasangle angle270 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   added: (hasangle angle120 link6) (hasangle angle60 link7) (hasangle angle150 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 6 of 14
14. (decrease_angle link6 angle120 angle90)
   deleted: (hasangle angle120 link6) (hasangle angle60 link7) (hasangle angle150 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   added: (hasangle angle90 link6) (hasangle angle30 link7) (hasangle angle120 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 6 of 14
15. (increase_angle link7 angle30 angle60)
   deleted: (hasangle angle30 link7) (hasangle angle120 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle60 link7) (hasangle angle150 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 7 of 14
16. (increase_angle link7 angle60 angle90)
   deleted: (hasangle angle60 link7) (hasangle angle150 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   added: (hasangle angle90 link7) (hasangle angle180 link8) (hasangle angle270 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   goals met: 7 of 14
17. (increase_angle link7 angle90 angle120)
   deleted: (hasangle angle90 link7) (hasangle angle180 link8) (hasangle angle270 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   added: (hasangle angle120 link7) (hasangle angle210 link8) (hasangle angle300 link9) (hasangle angle300 link10) (hasangle angle210 link11) (hasangle angle150 link12) (hasangle angle60 link13) (hasangle angle300 link14)
   goals met: 8 of 14
18. (decrease_angle link9 angle300 angle270)
   deleted: (hasangle angle300 link9) (hasangle angle300 link10) (hasangle angle210 link11) (hasangle angle150 link12) (hasangle angle60 link13) (hasangle angle300 link14)
   added: (hasangle angle270 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   goals met: 9 of 14
19. (decrease_angle link9 angle270 angle240)
   deleted: (hasangle angle270 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   added: (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 9 of 14
20. (decrease_angle link9 angle240 angle210)
   deleted: (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   added: (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 8 of 14
21. (decrease_angle link8 angle210 angle180)
   deleted: (hasangle angle210 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   goals met: 8 of 14
22. (increase_angle link9 angle180 angle210)
   deleted: (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   added: (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 7 of 14
23. (decrease_angle link8 angle180 angle150)
   deleted: (hasangle angle180 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle150 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   goals met: 8 of 14
24. (increase_angle link9 angle180 angle210)
   deleted: (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   added: (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 7 of 14
25. (decrease_angle link8 angle150 angle120)
   deleted: (hasangle angle150 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle120 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   goals met: 8 of 14
26. (increase_angle link11 angle90 angle120)
   deleted: (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   added: (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 7 of 14
27. (increase_angle link8 angle120 angle150)
   deleted: (hasangle angle120 link8) (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle150 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 8 of 14
28. (increase_angle link8 angle150 angle180)
   deleted: (hasangle angle150 link8) (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   added: (hasangle angle180 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   goals met: 8 of 14
29. (increase_angle link8 angle180 angle210)
   deleted: (hasangle angle180 link8) (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   added: (hasangle angle210 link8) (hasangle angle270 link9) (hasangle angle270 link10) (hasangle angle210 link11) (hasangle angle150 link12) (hasangle angle60 link13) (hasangle angle300 link14)
   goals met: 8 of 14
30. (decrease_angle link9 angle270 angle240)
   deleted: (hasangle angle270 link9) (hasangle angle270 link10) (hasangle angle210 link11) (hasangle angle150 link12) (hasangle angle60 link13) (hasangle angle300 link14)
   added: (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   goals met: 9 of 14
31. (decrease_angle link9 angle240 angle210)
   deleted: (hasangle angle240 link9) (hasangle angle240 link10) (hasangle angle180 link11) (hasangle angle120 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   added: (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 9 of 14
32. (decrease_angle link9 angle210 angle180)
   deleted: (hasangle angle210 link9) (hasangle angle210 link10) (hasangle angle150 link11) (hasangle angle90 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   added: (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 8 of 14
33. (decrease_angle link9 angle180 angle150)
   deleted: (hasangle angle180 link9) (hasangle angle180 link10) (hasangle angle120 link11) (hasangle angle60 link12) (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle150 link9) (hasangle angle150 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   goals met: 9 of 14
34. (decrease_angle link9 angle150 angle120)
   deleted: (hasangle angle150 link9) (hasangle angle150 link10) (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   added: (hasangle angle120 link9) (hasangle angle120 link10) (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   goals met: 10 of 14
35. (decrease_angle link9 angle120 angle90)
   deleted: (hasangle angle120 link9) (hasangle angle120 link10) (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   added: (hasangle angle90 link9) (hasangle angle90 link10) (hasangle angle30 link11) (hasangle angle330 link12) (hasangle angle240 link13) (hasangle angle120 link14)
   goals met: 9 of 14
36. (increase_angle link10 angle90 angle120)
   deleted: (hasangle angle90 link10) (hasangle angle30 link11) (hasangle angle330 link12) (hasangle angle240 link13) (hasangle angle120 link14)
   added: (hasangle angle120 link10) (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   goals met: 11 of 14
37. (increase_angle link11 angle60 angle90)
   deleted: (hasangle angle60 link11) (hasangle angle0 link12) (hasangle angle270 link13) (hasangle angle150 link14)
   added: (hasangle angle90 link11) (hasangle angle30 link12) (hasangle angle300 link13) (hasangle angle180 link14)
   goals met: 11 of 14
38. (increase_angle link13 angle300 angle330)
   deleted: (hasangle angle300 link13) (hasangle angle180 link14)
   added: (hasangle angle330 link13) (hasangle angle210 link14)
   goals met: 11 of 14
39. (increase_angle link13 angle330 angle0)
   deleted: (hasangle angle330 link13) (hasangle angle210 link14)
   added: (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 12 of 14
40. (increase_angle link13 angle0 angle30)
   deleted: (hasangle angle0 link13) (hasangle angle240 link14)
   added: (hasangle angle30 link13) (hasangle angle270 link14)
   goals met: 12 of 14
41. (decrease_angle link12 angle30 angle0)
   deleted: (hasangle angle30 link12) (hasangle angle30 link13) (hasangle angle270 link14)
   added: (hasangle angle0 link12) (hasangle angle0 link13) (hasangle angle240 link14)
   goals met: 13 of 14
42. (decrease_angle link14 angle240 angle210)
   deleted: (hasangle angle240 link14)
   added: (hasangle angle210 link14)
   goals met: 12 of 14
43. (increase_angle link13 angle0 angle30)
   deleted: (hasangle angle0 link13) (hasangle angle210 link14)
   added: (hasangle angle30 link13) (hasangle angle240 link14)
   goals met: 14 of 14
